/*
Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
3 -> 1, 8, 27
5 -> 1, 8, 27, 64, 125
*/

int GetNumber(string message)
{
    int result = 0;

    while (true)
    {
        Console.WriteLine(message);

        if (int.TryParse(Console.ReadLine(), out result))
        {
            break;
        }
        else
        {
            Console.WriteLine("Ввели не чило или 0. Повторите попытку");
        }
    }

    return result;
}

int x1 = GetNumber("Введите число");

for (int i = 1; i <= x1; i++)
{
    System.Console.Write($"{Math.Pow(i,3)} ");
}
